## Plan Result (prod-app-registrations)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.this.azurerm_role_assignment.this[&#34;DTS FinOps Enterprise Reporting-Contributor-/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb&#34;]
  * module.this.azurerm_role_assignment.this[&#34;DTS FinOps Enterprise Reporting-Contributor-/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/finops-reporting-sbox-rg&#34;]
* Delete
  * module.this.azurerm_role_assignment.this[&#34;DTS FinOps Enterprise Reporting-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.this.azurerm_role_assignment.this["DTS FinOps Enterprise Reporting-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"] will be destroyed
  # (because key ["DTS FinOps Enterprise Reporting-Contributor-/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"] is not in for_each map)
  - resource "azurerm_role_assignment" "this" {
      - id                   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleAssignments/3fef52d8-9e8a-4dc4-e0db-3f659902889e" -> null
      - name                 = "3fef52d8-9e8a-4dc4-e0db-3f659902889e" -> null
      - principal_id         = "c6368285-f820-4f2d-874d-43997c9a2c09" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> null
      - role_definition_name = "Contributor" -> null
      - scope                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab" -> null
    }

  # module.this.azurerm_role_assignment.this["DTS FinOps Enterprise Reporting-Contributor-/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c6368285-f820-4f2d-874d-43997c9a2c09"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.this.azurerm_role_assignment.this["DTS FinOps Enterprise Reporting-Contributor-/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/finops-reporting-sbox-rg"] will be created
  + resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c6368285-f820-4f2d-874d-43997c9a2c09"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/finops-reporting-sbox-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.this.azuread_application.this["DTS FinOps Enterprise Reporting"] has changed
  ~ resource "azuread_application" "this" {
      + group_membership_claims        = []
        id                             = "cea9ebb6-9cbc-4656-b09f-286bcc91b015"
      + identifier_uris                = []
        tags                           = []
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.this.azuread_service_principal.this["DTS FinOps Enterprise Reporting"] has changed
  ~ resource "azuread_service_principal" "this" {
      + alternative_names            = []
        id                           = "c6368285-f820-4f2d-874d-43997c9a2c09"
      + notification_email_addresses = []
        tags                         = []
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":38,"Program":"tfcmt","SHA1":"","Target":"prod-app-registrations","Vars":{}} -->